model {
  ssd {
    num_classes: 15  # 클래스 수를 15로 설정
    image_resizer {
      fixed_shape_resizer {
        height: 1024
        width: 1024
      }
    }
    feature_extractor {
      type: "ssd_resnet50_v1_fpn"
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          decay: 0.997
          center: true
          scale: true
          epsilon: 0.001
          train: true
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config {
  batch_size: 24
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.004
          decay_steps: 800720
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "D:/다운로드/ssd_resnet50_v1_fpn_1024x1024_coco17_tpu-8/checkpoint/ckpt-0"
  fine_tune_checkpoint_type: "detection"
  num_steps: 200000
  startup_delay_steps: 0.0
  use_bfloat16: false
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
}

train_input_reader {
  label_map_path: "C:/Users/Jong Min Lee/OneDrive/Desktop/github/refrigerator/realsense/wrappers/tensorflow/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "C:/Users/Jong Min Lee/OneDrive/Desktop/github/refrigerator/realsense/wrappers/tensorflow/train.record"
  }
}

eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}

eval_input_reader {
  label_map_path: "C:/Users/Jong Min Lee/OneDrive/Desktop/github/refrigerator/realsense/wrappers/tensorflow/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "C:/Users/Jong Min Lee/OneDrive/Desktop/github/refrigerator/realsense/wrappers/tensorflow/val.record"
  }
}
